MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/edc/PIC32MX430F064L.PIC
      <edc:SFRDef edc:_addr="0x1F886360" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-01618_TRAE_Ports.Module" edc:_refcount="4" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="CNPDD" edc:desc="" edc:grp="PORTD" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxxxxxxxxxxxxxxx" edc:name="CNPDD" edc:nzwidth="0x20" edc:por="----------------xxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNPDD0" edc:desc="" edc:mask="0x1" edc:name="CNPDD0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDD1" edc:desc="" edc:mask="0x1" edc:name="CNPDD1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDD2" edc:desc="" edc:mask="0x1" edc:name="CNPDD2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDD3" edc:desc="" edc:mask="0x1" edc:name="CNPDD3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDD4" edc:desc="" edc:mask="0x1" edc:name="CNPDD4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDD5" edc:desc="" edc:mask="0x1" edc:name="CNPDD5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDD6" edc:desc="" edc:mask="0x1" edc:name="CNPDD6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDD7" edc:desc="" edc:mask="0x1" edc:name="CNPDD7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDD8" edc:desc="" edc:mask="0x1" edc:name="CNPDD8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDD9" edc:desc="" edc:mask="0x1" edc:name="CNPDD9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDD10" edc:desc="" edc:mask="0x1" edc:name="CNPDD10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDD11" edc:desc="" edc:mask="0x1" edc:name="CNPDD11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDD12" edc:desc="" edc:mask="0x1" edc:name="CNPDD12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDD13" edc:desc="" edc:mask="0x1" edc:name="CNPDD13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDD14" edc:desc="" edc:mask="0x1" edc:name="CNPDD14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDD15" edc:desc="" edc:mask="0x1" edc:name="CNPDD15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F886370" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-01618_TRAE_Ports.Module" edc:_refcount="4" edc:access="----------------n-n-------------" edc:cname="CNCOND" edc:desc="" edc:grp="PORTD" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="CNCOND" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="13"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="CHANGE NOTICE" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F886380" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-01618_TRAE_Ports.Module" edc:_refcount="4" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="CNEND" edc:desc="" edc:grp="PORTD" edc:impl="0xffc0ffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000------xxxxxxxxxxxxxxxx" edc:name="CNEND" edc:nzwidth="0x20" edc:por="0000000000------xxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNIED0" edc:desc="" edc:mask="0x1" edc:name="CNIED0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIED1" edc:desc="" edc:mask="0x1" edc:name="CNIED1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIED2" edc:desc="" edc:mask="0x1" edc:name="CNIED2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIED3" edc:desc="" edc:mask="0x1" edc:name="CNIED3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIED4" edc:desc="" edc:mask="0x1" edc:name="CNIED4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIED5" edc:desc="" edc:mask="0x1" edc:name="CNIED5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIED6" edc:desc="" edc:mask="0x1" edc:name="CNIED6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIED7" edc:desc="" edc:mask="0x1" edc:name="CNIED7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIED8" edc:desc="" edc:mask="0x1" edc:name="CNIED8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIED9" edc:desc="" edc:mask="0x1" edc:name="CNIED9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIED10" edc:desc="" edc:mask="0x1" edc:name="CNIED10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIED11" edc:desc="" edc:mask="0x1" edc:name="CNIED11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIED12" edc:desc="" edc:mask="0x1" edc:name="CNIED12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIED13" edc:desc="" edc:mask="0x1" edc:name="CNIED13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIED14" edc:desc="" edc:mask="0x1" edc:name="CNIED14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIED15" edc:desc="" edc:mask="0x1" edc:name="CNIED15" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F886390" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-01618_TRAE_Ports.Module" edc:_refcount="4" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="CNSTATD" edc:desc="" edc:grp="PORTD" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxxxxxxxxxxxxxxx" edc:name="CNSTATD" edc:nzwidth="0x20" edc:por="----------------xxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNSTATD0" edc:desc="" edc:mask="0x1" edc:name="CNSTATD0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATD1" edc:desc="" edc:mask="0x1" edc:name="CNSTATD1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATD2" edc:desc="" edc:mask="0x1" edc:name="CNSTATD2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATD3" edc:desc="" edc:mask="0x1" edc:name="CNSTATD3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATD4" edc:desc="" edc:mask="0x1" edc:name="CNSTATD4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATD5" edc:desc="" edc:mask="0x1" edc:name="CNSTATD5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATD6" edc:desc="" edc:mask="0x1" edc:name="CNSTATD6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATD7" edc:desc="" edc:mask="0x1" edc:name="CNSTATD7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATD8" edc:desc="" edc:mask="0x1" edc:name="CNSTATD8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATD9" edc:desc="" edc:mask="0x1" edc:name="CNSTATD9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATD10" edc:desc="" edc:mask="0x1" edc:name="CNSTATD10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATD11" edc:desc="" edc:mask="0x1" edc:name="CNSTATD11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATD12" edc:desc="" edc:mask="0x1" edc:name="CNSTATD12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATD13" edc:desc="" edc:mask="0x1" edc:name="CNSTATD13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATD14" edc:desc="" edc:mask="0x1" edc:name="CNSTATD14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATD15" edc:desc="" edc:mask="0x1" edc:name="CNSTATD15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8863A0" edc:offset="96"/>
      <edc:SFRDef edc:_addr="0x1F886400" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-01618_TRAE_Ports.Module" edc:_refcount="5" edc:access="------------------------nnnn-n--" edc:cname="ANSELE" edc:desc="" edc:grp="PORTE" edc:impl="0xffff00f4" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------1111-1--" edc:name="ANSELE" edc:nzwidth="0x20" edc:por="------------------------1111-1--" edc:portals="CLR SET INV">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ANSE2" edc:desc="" edc:mask="0x1" edc:name="ANSE2" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ANSE4" edc:desc="" edc:mask="0x1" edc:name="ANSE4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSE5" edc:desc="" edc:mask="0x1" edc:name="ANSE5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSE6" edc:desc="" edc:mask="0x1" edc:name="ANSE6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSE7" edc:desc="" edc:mask="0x1" edc:name="ANSE7" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x0" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F886410" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-01618_TRAE_Ports.Module" edc:_refcount="5" edc:access="----------------------nnnnnnnnnn" edc:cname="TRISE" edc:desc="" edc:grp="PORTE" edc:impl="0xffff03ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------1111111111" edc:name="TRISE" edc:nzwidth="0x20" edc:por="----------------------1111111111" edc:portals="CLR SET INV">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TRISE0" edc:desc="" edc:mask="0x1" edc:name="TRISE0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISE1" edc:desc="" edc:mask="0x1" edc:name="TRISE1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISE2" edc:desc="" edc:mask="0x1" edc:name="TRISE2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISE3" edc:desc="" edc:mask="0x1" edc:name="TRISE3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISE4" edc:desc="" edc:mask="0x1" edc:name="TRISE4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISE5" edc:desc="" edc:mask="0x1" edc:name="TRISE5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISE6" edc:desc="" edc:mask="0x1" edc:name="TRISE6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISE7" edc:desc="" edc:mask="0x1" edc:name="TRISE7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISE8" edc:desc="" edc:mask="0x1" edc:name="TRISE8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRISE9" edc:desc="" edc:mask="0x1" edc:name="TRISE9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F886420" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-01618_TRAE_Ports.Module" edc:_refcount="5" edc:access="----------------------nnnnnnnnnn" edc:cname="PORTE" edc:desc="" edc:grp="PORTE" edc:impl="0xffff03ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------xxxxxxxxxx" edc:name="PORTE" edc:nzwidth="0x20" edc:por="----------------------xxxxxxxxxx" edc:portals="CLR SET INV" ltx:baseofperipheral="PORTE">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RE0" edc:desc="" edc:mask="0x1" edc:name="RE0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RE1" edc:desc="" edc:mask="0x1" edc:name="RE1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RE2" edc:desc="" edc:mask="0x1" edc:name="RE2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RE3" edc:desc="" edc:mask="0x1" edc:name="RE3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RE4" edc:desc="" edc:mask="0x1" edc:name="RE4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RE5" edc:desc="" edc:mask="0x1" edc:name="RE5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RE6" edc:desc="" edc:mask="0x1" edc:name="RE6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RE7" edc:desc="" edc:mask="0x1" edc:name="RE7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RE8" edc:desc="" edc:mask="0x1" edc:name="RE8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RE9" edc:desc="" edc:mask="0x1" edc:name="RE9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F886430" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-01618_TRAE_Ports.Module" edc:_refcount="5" edc:access="----------------------nnnnnnnnnn" edc:cname="LATE" edc:desc="" edc:grp="PORTE" edc:impl="0xffff03ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------xxxxxxxxxx" edc:name="LATE" edc:nzwidth="0x20" edc:por="----------------------xxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTE">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="LATE0" edc:desc="" edc:mask="0x1" edc:name="LATE0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATE1" edc:desc="" edc:mask="0x1" edc:name="LATE1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATE2" edc:desc="" edc:mask="0x1" edc:name="LATE2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATE3" edc:desc="" edc:mask="0x1" edc:name="LATE3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATE4" edc:desc="" edc:mask="0x1" edc:name="LATE4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATE5" edc:desc="" edc:mask="0x1" edc:name="LATE5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATE6" edc:desc="" edc:mask="0x1" edc:name="LATE6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATE7" edc:desc="" edc:mask="0x1" edc:name="LATE7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATE8" edc:desc="" edc:mask="0x1" edc:name="LATE8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATE9" edc:desc="" edc:mask="0x1" edc:name="LATE9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F886440" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-01618_TRAE_Ports.Module" edc:_refcount="5" edc:access="----------------------nnnnnnnnnn" edc:cname="ODCE" edc:desc="" edc:grp="PORTE" edc:impl="0xffff03ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------0000000000" edc:name="ODCE" edc:nzwidth="0x20" edc:por="----------------------0000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTE">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ODCE0" edc:desc="" edc:mask="0x1" edc:name="ODCE0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCE1" edc:desc="" edc:mask="0x1" edc:name="ODCE1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCE2" edc:desc="" edc:mask="0x1" edc:name="ODCE2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCE3" edc:desc="" edc:mask="0x1" edc:name="ODCE3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCE4" edc:desc="" edc:mask="0x1" edc:name="ODCE4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCE5" edc:desc="" edc:mask="0x1" edc:name="ODCE5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCE6" edc:desc="" edc:mask="0x1" edc:name="ODCE6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCE7" edc:desc="" edc:mask="0x1" edc:name="ODCE7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCE8" edc:desc="" edc:mask="0x1" edc:name="ODCE8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCE9" edc:desc="" edc:mask="0x1" edc:name="ODCE9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F886450" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-01618_TRAE_Ports.Module" edc:_refcount="5" edc:access="----------------------nnnnnnnnnn" edc:cname="CNPUE" edc:desc="" edc:grp="PORTE" edc:impl="0xffff03ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------xxxxxxxxxx" edc:name="CNPUE" edc:nzwidth="0x20" edc:por="----------------------xxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTE">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNPUE0" edc:desc="" edc:mask="0x1" edc:name="CNPUE0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUE1" edc:desc="" edc:mask="0x1" edc:name="CNPUE1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUE2" edc:desc="" edc:mask="0x1" edc:name="CNPUE2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUE3" edc:desc="" edc:mask="0x1" edc:name="CNPUE3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUE4" edc:desc="" edc:mask="0x1" edc:name="CNPUE4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUE5" edc:desc="" edc:mask="0x1" edc:name="CNPUE5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUE6" edc:desc="" edc:mask="0x1" edc:name="CNPUE6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUE7" edc:desc="" edc:mask="0x1" edc:name="CNPUE7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUE8" edc:desc="" edc:mask="0x1" edc:name="CNPUE8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUE9" edc:desc="" edc:mask="0x1" edc:name="CNPUE9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
