MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/edc/PIC32MX430F064L.PIC
      <edc:SFRDef edc:_addr="0x1F886640" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-01618_TRAE_Ports.Module" edc:_refcount="7" edc:access="----------------nnnn--nnnn----nn" edc:cname="ODCG" edc:desc="" edc:grp="PORTG" edc:impl="0xfffff3c3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000--0000----00" edc:name="ODCG" edc:nzwidth="0x20" edc:por="----------------0000--0000----00" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ODCG0" edc:desc="" edc:mask="0x1" edc:name="ODCG0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCG1" edc:desc="" edc:mask="0x1" edc:name="ODCG1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ODCG6" edc:desc="" edc:mask="0x1" edc:name="ODCG6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCG7" edc:desc="" edc:mask="0x1" edc:name="ODCG7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCG8" edc:desc="" edc:mask="0x1" edc:name="ODCG8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCG9" edc:desc="" edc:mask="0x1" edc:name="ODCG9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ODCG12" edc:desc="" edc:mask="0x1" edc:name="ODCG12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCG13" edc:desc="" edc:mask="0x1" edc:name="ODCG13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCG14" edc:desc="" edc:mask="0x1" edc:name="ODCG14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCG15" edc:desc="" edc:mask="0x1" edc:name="ODCG15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F886650" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-01618_TRAE_Ports.Module" edc:_refcount="7" edc:access="----------------nnnn--nnnn----nn" edc:cname="CNPUG" edc:desc="" edc:grp="PORTG" edc:impl="0xfffff3c3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxxx--xxxx----xx" edc:name="CNPUG" edc:nzwidth="0x20" edc:por="----------------xxxx--xxxx----xx" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNPUG0" edc:desc="" edc:mask="0x1" edc:name="CNPUG0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUG1" edc:desc="" edc:mask="0x1" edc:name="CNPUG1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPUG6" edc:desc="" edc:mask="0x1" edc:name="CNPUG6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUG7" edc:desc="" edc:mask="0x1" edc:name="CNPUG7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUG8" edc:desc="" edc:mask="0x1" edc:name="CNPUG8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUG9" edc:desc="" edc:mask="0x1" edc:name="CNPUG9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPUG12" edc:desc="" edc:mask="0x1" edc:name="CNPUG12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUG13" edc:desc="" edc:mask="0x1" edc:name="CNPUG13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUG14" edc:desc="" edc:mask="0x1" edc:name="CNPUG14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUG15" edc:desc="" edc:mask="0x1" edc:name="CNPUG15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F886660" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-01618_TRAE_Ports.Module" edc:_refcount="7" edc:access="----------------nnnn--nnnn----nn" edc:cname="CNPDG" edc:desc="" edc:grp="PORTG" edc:impl="0xfffff3c3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxxx--xxxx----xx" edc:name="CNPDG" edc:nzwidth="0x20" edc:por="----------------xxxx--xxxx----xx" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNPDG0" edc:desc="" edc:mask="0x1" edc:name="CNPDG0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDG1" edc:desc="" edc:mask="0x1" edc:name="CNPDG1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPDG6" edc:desc="" edc:mask="0x1" edc:name="CNPDG6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDG7" edc:desc="" edc:mask="0x1" edc:name="CNPDG7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDG8" edc:desc="" edc:mask="0x1" edc:name="CNPDG8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDG9" edc:desc="" edc:mask="0x1" edc:name="CNPDG9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPDG12" edc:desc="" edc:mask="0x1" edc:name="CNPDG12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDG13" edc:desc="" edc:mask="0x1" edc:name="CNPDG13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDG14" edc:desc="" edc:mask="0x1" edc:name="CNPDG14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDG15" edc:desc="" edc:mask="0x1" edc:name="CNPDG15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
